Revit 2027 API
PointOnPlane.SetPlaneReference Method
Change the geometric plane reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPlaneReference(
	Reference planeReference
)
Public Sub SetPlaneReference (
	planeReference As Reference
)
public:
void SetPlaneReference(
	Reference^ planeReference
)
member SetPlaneReference :
        planeReference : Reference -> unit
Parameters
planeReference Reference
A reference to some plane in the document. (Note: the reference must satisfy IsValidPlaneReference(), but this is not checked until this PointOnPlane object is assigned to a ReferencePoint.)
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace